app/controllers/posts_controller.rb

    def create
        @post = Post.new
        @post.title = params[:post][:title]
        @post.text = params[:post][:text]
        @post.expec = params[:post][:expec]
        @post.notes = params[:post][:notes]

        @post.save
---
INSERT INTO "posts" ("created_at", "expec", "text", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 08 Jul 2013 18:20:00 UTC +00:00], ["expec", "Enter Expectation Here..."], ["text", "Enter Step Here..."], ["title", ""], ["updated_at", Mon, 08 Jul 2013 18:20:00 UTC +00:00]]

    def update
        @post = Post.find(params[:id])
        @post.update_attributes(params[:post])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "11"]]
UPDATE "posts" SET "notes" = 'Credit Card Numbers', "updated_at" = '2013-07-09 15:11:28.006134' WHERE "posts"."id" = 7